Masmiseim36/nxpSDK/boards/frdmk64f/demo_apps/sigfox_console/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTD1 (number 94), J2[12]
  @{ */
#define BOARD_SF_SCK_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SF_SCK_PIN 1U     /*!<@brief PORTD pin index: 1 */
                                /* @} */

/*! @name PORTD3 (number 96), J2[10]
  @{ */
#define BOARD_SF_MISO_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SF_MISO_PIN 3U     /*!<@brief PORTD pin index: 3 */
                                 /* @} */

/*! @name PORTD2 (number 95), J2[8]
  @{ */
#define BOARD_SF_MOSI_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SF_MOSI_PIN 2U     /*!<@brief PORTD pin index: 2 */
                                 /* @} */

/*! @name PORTD0 (number 93), J2[6]
  @{ */
#define BOARD_SF_CS_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_SF_CS_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SF_CS_PIN 0U     /*!<@brief PORTD pin index: 0 */
                               /* @} */

/*! @name PORTC4 (number 76), J2[4]
  @{ */
#define BOARD_SF_ACK_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_SF_ACK_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SF_ACK_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTB17 (number 63), U10[1]/UART0_TX
  @{ */
#define BOARD_DEBUG_UART_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_DEBUG_UART_TX_PIN 17U    /*!<@brief PORTB pin index: 17 */
                                       /* @} */

/*! @name PORTB16 (number 62), U7[4]/UART0_RX
  @{ */
#define BOARD_DEBUG_UART_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_DEBUG_UART_RX_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
